Revit 2026 API

# RebarSpliceMoveRebarSpliceGeometry Method

---

Moves the RebarSpliceGeometry with the specified vector.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void MoveRebarSpliceGeometry(
	XYZ translation
)
```
```vb
Public Sub MoveRebarSpliceGeometry (
	translation As XYZ
)
```
```cpp
public:
void MoveRebarSpliceGeometry(
	XYZ^ translation
)
```
```fsharp
member MoveRebarSpliceGeometry :
        translation : XYZ -> unit
```

#### Parameters

translation XYZ
     The translation vector that will be applied.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

RebarSplice Class

Autodesk.Revit.DB.Structure Namespace